local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
    [2900] = "平胡",
    [2901] = "碰碰胡",
    [2902] = "七对子",
    [2903] = "豪华七对",
    [2904] = "混一色",
    [2905] = "清一色",
    [2906] = "全风字",
    [2907] = "全落地",
    [2908] = "单吊",
    [2909] = "财吊",
    [2910] = "杠上开花",
    [2911] = "杠爆",
    [2912] = "杠上飞财",
    [2913] = "海底捞月",
    [2914] = "飞财",
    [2915] = "双飞财",
    [2916] = "十三幺七风不全",
    [2917] = "十三幺七风全",
    [2918] = "正宗七风",
    [2919] = "十三幺缺一门",
    [2920] = "乱百搭",
    [2921] = "无财七对",
    [2922] = "七对财吊",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [2900] = 1,
    [2901] = 2,
    [2902] = 2,
    [2903] = 4,
    [2904] = 2,
    [2905] = 8,
    [2906] = 40,
    [2907] = 2,
    [2908] = 2,
    [2909] = 2,
    [2910] = 2,
    [2911] = 4,
    [2912] = 8,
    [2913] = 2,
    [2914] = 4,
    [2915] = 8,
    [2916] = 2,
    [2917] = 2,
    [2918] = 4,
    [2919] = 32,
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS_BEIXIANG =
{
    [2900] = 1,
    [2902] = 1,
    [2909] = 4,
    [2914] = 8,
    [2915] = 16,
    [2920] = 1,
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS_BEIXIANG_WU_FENG =
{
    [2900] = 1,
    [2902] = 2,
    [2909] = 2,
    [2914] = 6,
    [2915] = 12,
    [2921] = 6,
    [2922] = 6,
}

return WinLostFanConfig