local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.WINLOST_FAN_TYPE = {
    [11] = "字一色",
    [23] = "对对胡",
    [29] = "门清",
    [31] = "混一色",
    [32] = "清一色",

    [33] = "大吊",
    [48] = "无龙",

    [1001] = "抛头",
    [1002] = "财飘",
    [1003] = "一飞龙",
    [1004] = "二飞龙",
    [1005] = "三飞龙",

    [1006] = "四飞龙",
    [1007] = "杠开",
    [1008] = "四龙齐",
    [1009] = "四红中",
    [1010] = "四发财",

    [1011] = "四白板",
    [1012] = "无花无龙",
    [1013] = "四花齐",
    [1014] = "豹子",
    [1015] = "天胡",
    [1016] = "门清",

    [1017] = "无龙",
    [1018] = "大吊",
    [1019] = "混一色",
    [1020] = "字一色",
}

WinLostFanConfig.WINLOST_HUA_TYPE = {
    [3001] = "底花",
    [3002] = "花牌",
    [3003] = "普通明杠",
    [3004] = "普通暗杠",
    [3005] = "风牌刻",
    [3006] = "风牌明杠",
    [3007] = "风牌暗杠",
    [3008] = "龙牌",
}

return WinLostFanConfig