local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
    [39] = "杠上开花",
    [41] = "天胡",
    [42] = "地胡",
    [90] = "枪杠胡",
    [2800] =  "混一色",
    [2801] =  "清一色",
    [2802] =  "大碰胡",
    [2803] =  "混碰",
    [2804] =  "清碰",
    [2805] =  "七对子",
    [2806] =  "混七对",
    [2807] =  "清七对",
    [2808] =  "十三百搭",
    [2809] =  "真百搭",
    [2810] =  "全风字",
    [2811] =  "全风字大碰胡",
    [2812] =  "全风字七对子",
    [2813] =  "三财神倒",
    [2814] =  "七风倒",
    [2815] =  "七风乱百搭",
    [2816] =  "平胡",
    [2817] =  "烂百搭",
    [2818] =  "海底捞月",
    [2819] = "单吊",
    [2820] =  "地胡",
    [2821] =  "天胡",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [2819] = 1,
    [39] = 1,
    [41] = 1,
    [42] = 1,
    [90] = 1,
    [2800] = 2,
    [2801] =  3,
    [2802] =  3,
    [2803] =  4,
    [2804] =  5,
    [2805] =  3,
    [2806] =  4,
    [2807] =  5,
    [2808] =  2,
    [2809] =  3,
    [2810] =  6,
    [2811] =  12,
    [2812] =  12,
    [2813] =  1,
    [2814] =  1,
    [2815] =  2,
    [2816] =  2,
    [2817] =  2,
    [2818] =  1,
    [2820] =  1,
    [2821] =  1,
}

WinLostFanConfig.GAME_TYPE =
{
     DUAN_ZI = 0,
     LA_TA   = 1,
     COUNT   = 2,
}

WinLostFanConfig.KW_WINLOST_EXT_FAN_ID = { 33, 39, 41, 42, 90, 2819, 2820, 2821 }

return WinLostFanConfig