local WinLostFanConfig = CF.gameClass("WinLostFanConfig","game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.WINLOST_FAN_TYPE = 
{        
    [2400] = {"平胡",},
    [2401] = {"十三幺",},
    [2402] = {"七星十三幺",},
    [2403] = {"对对胡",},
    [2404] = {"七小对",},
    [2405] = {"混一色",},
    [2406] = {"清一色",},
    [2407] = {"字一色",},
    [2408] = {"金鸡独立",},
    [2409] = {"杠上开花",},
    [2410] = {"海底捞月",},
    [2411] = {"地胡",},
    [2412] = {"天胡",},

    [3000] = {"",},
    [3001] = {"花",},
    [3002] = {"自摸",},
    [3003] = {"刻",},
    [3004] = {"杠",},

    [4000] = {"",},
    [4001] = {"基本底",},
    [4002] = {"字一色七小对",},
    [4003] = {"字一色对对胡",},
}


return WinLostFanConfigI