local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	[3000] = "杀猪 ",              --四财神杀猪
    [3001] = "杀猪 ",         --五财神杀猪
    [3002] = "杀猪 ",    --六财神杀猪
    [3003] = "杀猪 ",--相同财神杀猪
    [3004] = "花胡 ", --花胡
    [3005] = "自摸 ",--自摸
    [3006] = "四风齐 ",--四风齐
    [3007] = "杠上开花 ",--杠上开花
    [3008] = "抢杠胡 ",--抢杠胡
    [3009] = "海底捞 ",--海底捞月
    [3010] = "混一色 ",--混一色
    [3011] = "对对胡 ",--对对胡
    [3012] = "硬牌 ",--硬牌
    [3013] = "清一色 ",--清一色
    [3014] = "财神汇 ",--财神会
    [3015] = "单钓将 ",--单钓将
    [3016] = "财钓 ",--财钓
    [3017] = "门清 ",--门清
    [3018] = "天胡 ",--天胡
    [3019] = "地胡 ",--地胡
    [3020] = "杀猪胡 ",--四财神杀猪胡
    [3021] = "杀猪胡 ",--五财神杀猪胡
    [3022] = "杀猪胡 ",--六财神杀猪胡
    [3023] = "杀猪胡 ",--相同财神杀猪胡
    [3024] = "杀猪胡 ",--八花杀猪胡
    
    [3025] = "明杠 ",--基本明杠
    [3026] = "暗杠 ",--基本暗杠
    [3027] = "字明杠 ",--中明杠
    [3028] = "发明杠 ",--发明杠
    [3029] = "自风明杠 ",--自家风明杠
    [3030] = "字暗杠 ",--中暗杠
    [3031] = "发暗杠 ",--发暗杠
    [3032] = "自风暗杠 ",--自家风暗杠
    [3033] = "红中",--中暗刻
    [3034] = "发财 ",--发暗刻
    [3035] = "自家风 ",--财神搭自家风暗刻
    [3036] = "1小财神 ",--基本单财神
    [3037] = "2小财神 ",--基本双财神
    [3038] = "3小财神 ",--基本三财神
    [3039] = "1大财神 ",--特殊单财神
    [3040] = "2大财神 ",--特殊双财神
    [3041] = "3大财神 ",--特殊三财神
    [3042] = "1花 ",--一花
    [3043] = "2花 ",--双花
    [3044] = "3花 ",--三花
    [3045] = "4花 ",--四花
    [3046] = "起手四花 ",--起手四花
    [3047] = "1财神 ",--财神相同一财神
    [3048] = "2财神 ",--财神相同双财神
    [3049] = "平胡 ",
    
    [4000] = "红中 ",
    [4001] = "发财 ",
    [4002] = "自家风 ",
    [4003] = "字明杠 ",
    [4004] = "字暗杠 ",
    [4005] = "财神 ",
    [4006] = "花 ",
}

return WinLostFanConfig{	