local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {    

[3000] = "财神会",        
[3001] = "财神牛",        
[3002] = "天胡",            
[3003] = "地胡",            
[3004] = "四风齐",        
[3005] = "清一色",        
[3006] = "混一色",        
[3007] = "对对胡",            
[3008] = "单吊",            
[3009] = "自家风暗杠",        
[3010] = "暗杠",            
[3011] = "自家风明杠",
[3012] = "自摸",
[3013] = "杠上开花",
[3014] = "抢杠胡",
[3015] = "明杠",
[3016] = "自风刻",
[3017] = "平胡",
[3018] = "胡倒",
[3019] = "财神",


[3025] = "明杠",
[3026] = "暗杠",
[3027] = "自风明杠",
[3028] = "自风暗杠",
[3029] = "自风刻",
--  [3030] = "花",
[3500] = "三财神推倒胡",
[3501] = "三财神",
[3502] = "单台鸡",

[3600] = "花",
[3601] = "四红中",
[3602] = "四发财",
[3603] = "四红花会",
[3604] = "四黑花会",
[3605] = "四花会",
[3606] = "三财神",

}

return WinLostFanConfigi