local GameDefine = CF.gameClass("GameDefine", "game.Mahjong.BasicMahjong.Define.GameDefine")

GameDefine.WINLOST_FAN_TYPE = 
{        
    [3000] = "三财神推倒胡",               
    [3001] = "三财神",              
    [3002] = "四花胡",                 
    [3003] = "天胡",                
    [3004] = "四花推倒",              
    [3005] = "地胡",
    [3006] = "自家花",              
    [3007] = "黑花",             
    [3008] = "抢杠胡",                
    [3009] = "自风刻", 
    [3010] = "自风杠",                
    [3011] = "红中刻",   
    [3012] = "红中杠",          
    [3013] = "发财刻",  
    [3014] = "发财杠",                
    [3015] = "白板刻", 
    [3016] = "白板杠",      
    [3017] = "自摸",
    [3018] = "无财神",
    [3019] = "财神归位",
    [3020] = "双财神",
    [3021] = "软牌",
    [3022] = "咸菜",
}

return GameDefine�