local WinLostFanConfig = CF.gameClass("WinLostFanConfig","game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.WINLOST_FAN_TYPE = 
{        
    [2400] = {"随便胡",},
    [2401] = {"排排胡",},
    [2402] = {"碰碰胡",},
    [2403] = {"混一色",},
    [2404] = {"字一色",},
    [2405] = {"清一色",},
    [2406] = {"自摸",},
    [2407] = {"对倒",},
    [2408] = {"坎张",},
    [2409] = {"边张",},
    [2410] = {"单钓将",},
    [2411] = {"拉杠胡",},
    [2412] = {"杠上开花",},
    [2413] = {"海底捞月",},
    [2414] = {"地胡",},
    [2415] = {"天胡",},

    [3001] = {"花",},
    [3002] = {"刻子",},
    [3003] = {"杠",},

    [4001] = {"底胡",},
    [4002] = {"自摸",},
    [4003] = {"边张",},
    [4004] = {"坎张",},
    [4005] = {"单钓将",},
    [4006] = {"花",},
    [4007] = {"刻子",},
    [4008] = {"杠",},
    [4009] = {"对",},
}


return WinLostFanConfig�