local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	--长兴
    [2900] = "自摸",
    [2901] = "自摸",
    [2902] = "放冲",
    [2903] = "十三断",
    [2904] = "十三断",
    [2905] = "七对",
    [2906] = "七对",
    [2907] = "抢杠胡",
    [2908] = "杠开",
    [2909] = "杠开",
    [2910] = "杠爆",
    [2911] = "爆头",
    [2912] = "四白板",
    [2913] = "天胡",
    [2914] = "地胡",
    [2915] = "豪华七对",
    [2916] = "豪华七对",
    [2917] = "超豪华七对",
    [2918] = "超豪华七对",
    [2919] = "超超豪华七对",
    [2920] = "超超豪华七对",
    [2921] = "清一色",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [2900] = 3,
    [2901] = 6,
    [2902] = 2,
    [2903] = 6,
    [2904] = 3,
    [2905] = 12,
    [2906] = 4,
    [2907] = 10,
    [2908] = 12,
    [2909] = 6,
    [2910] = 10,
    [2911] = 5,
    [2912] = 10,
    [2913] = 10,
    [2914] = 10,
    [2915] = 24,
    [2916] = 8,
    [2917] = 48,
    [2918] = 16,
    [2919] = 96,
    [2920] = 32,
    [2921] = 2,
}

return WinLostFanConfig�