local CaiYunGuideConfig = CF.gameClass("CaiYunGuideConfig")

CaiYunGuideConfig.SpineConfig = {
    light = {json = "animation/GameCommon/prop_ani/cy_guideLight/Qd_4.json", atlas = "animation/GameCommon/prop_ani/cy_guideLight/Qd_4.atlas", aniName = "animation", scale = 0.7},
}

CaiYunGuideConfig.State = {
    TIMEOUT     = 1, -- 超时未使用
    SHOW        = 2, -- 显示
    USE_SUCCESS = 3, -- 使用成功
}

CaiYunGuideConfig.Scene = {
    SCENE_0 = 0,
    SCENE_1 = 1,    -- 每小局首次听牌，并且打出牌之后触发
    SCENE_2 = 2,    -- 每小局听牌状态持续摸5张牌未胡牌，且剩余可摸的牌大于10张，且打出牌之后触发，如没轮到出牌的， 则牌展示完时触发
    SCENE_3 = 3,    -- 每小局听牌状态持续摸8张牌未胡牌，且剩余可摸的牌大于10张，且打出牌之后触发，如没轮到出牌的， 则牌展示完时触发
    SCENE_4 = 4,    -- 每小局剩余最后10张可摸的牌时触发
}

CaiYunGuideConfig.Tips = {
    -- [101622] = { '召唤貔貅,\n吸金纳福!', '召唤貔貅,\n吸金纳福!', '召唤貔貅,\n吸金纳福!', '召唤貔貅,\n避邪纳财!' },
    [150697] = { '关键时刻,\n洗洗手摸好牌?', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n换换手气吧!' },
    -- [150698] = { '桌子晃一晃,\n运气转一转!', '桌子晃一晃,\n运气转一转!', '桌子晃一晃,\n运气转一转!', '牌张不多了,\n转转运!' },
    [150699] = { '焚三炷清香,\n好牌速速来!', '摸不到牌,\n心诚则灵!', '摸不到牌,\n心诚则灵!', '焚三炷清香,\n好牌速速来!' },
    -- [101489] = { '妈祖降福,\n富贵荣华!', '妈祖降福,\n富贵荣华!', '妈祖降福,\n富贵荣华!', '妈祖降福,\n富贵荣华!' },
    -- [101490] = { '海底捞月,\n时来运转!', '海底捞月,\n时来运转!', '海底捞月,\n时来运转!', '牌张不多了,\n海底捞一捞!' },
    [101482] = { '关键时刻,洗\n洗手摸好牌?', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n换换手气吧!' },
    -- [101487] = { '霉运退散,\n好运常来!', '霉运退散,\n好运常来!', '霉运退散,\n好运常来!', '霉运退散,\n好运常来!' },
    -- [101488] = { '招财进宝,\n财运滚滚来!', '招财进宝,\n财运滚滚来!', '招财进宝,\n财运滚滚来!', '招财进宝,\n财运滚滚来!' },
    [101484] = { '焚三炷清香,\n好牌速速来!', '摸不到牌,\n心诚则灵!', '摸不到牌,\n心诚则灵!', '焚三炷清香,\n好牌速速来!' },
    -- [101485] = { '摇摇招财树,\n喜迎财运到!', '摸不到牌,\n摇点财气?', '摸不到牌,\n摇点财气?', '牌张不多了,\n快摇点财运!' },
    -- [101483] = { '邪气退散,\n要金得金!', '邪气退散,\n要金得金!', '邪气退散,\n要金得金!', '牌张不多了,\n驱走霉运!' },
    -- [101519] = { '猫爪一挥,\n财运速到!', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n换换手气吧!' },
    -- [101520] = { '一枚上上签,\n好牌马上到!', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n快抽点财运!' },
    -- [120417] = { '大吉大利,\n速速胡牌!', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n转转运!' },
    -- [120416] = { '时来运转,\n好运连连!', '摸不到牌,\n换换手气?', '摸不到牌,\n换换手气?', '牌张不多了,\n转转运!' },
    [150728] = { '想什么牌,\n来什么牌', '想什么牌,\n来什么牌', '财神财神,\n快来快来', '一定是我想\n要的' },
}

CaiYunGuideConfig.TotalConfig = {
    scene = {
        -- 麻将：各种出现场景下，对应的触发条件，数组第一位表示持续摸牌的回合数，第二位表示剩余的牌，第三位表示概率，第四位表示，该类型触发后未使用的情况下，接下来的几局都不会再触发该类型
        [CaiYunGuideConfig.Scene.SCENE_1] = { 20, 3 }, -- 场景一除了首次听牌，就只有一个概率条件
        [CaiYunGuideConfig.Scene.SCENE_2] = { 5, 10, 20, 3 },
        [CaiYunGuideConfig.Scene.SCENE_3] = { 8, 10, 20, 3 },
        [CaiYunGuideConfig.Scene.SCENE_4] = { 24, 20, 3 }, -- 场景4只是在剩余10张牌时触发
    },
    roundMax = 2, -- 每小局如果已使用求财运任意道具2个，则不触发（时效道具持续时间不包含在内）
    showTimeCD = 10, -- 触发任意1条10秒内有其他再次满足触发条件，则不显示
    minTime = 5, -- 最小显示时长5s
    maxTime = 10, -- 最大显示时长10s
    useAfterTimes = 3, -- 如果点击后成功使用，则后续3次激活时重新回到5秒展示，无论这3次的前一次有没有使用都不会增加时长
}

return CaiYunGuideConfig