--[[
	游戏玩法相关配置
	暂时自己写table，后续改成表配置
	by lushihan
]]--

local tab = {}

-- 客户端默认规则
tab.GameRuleDefault = {
	[0] = {
		["Allow3Cnt"] = true,
		["Allow3With2"] = true,
		["Allow4With4"] = true,
		["ShowRemainCardsNum"] = true
	},
    [30409] = {},
    [30424] = {},
	[30442] = {},
	[30156] = {},
}

-- 配置项显示内容
tab.GameRuleText = {
	[0] = {
		["callScore"] = {
			["0"] = "叫分/",
			["1"] = "叫地主/"
		},
		["BombCount"] = {
			["1"] = "%d炸/"
		},
		["addDouble"] = {
			["0"] = "不加倍/",
			["1"] = "加倍/"
		},
		["allowOpenDeal"] = {
			["0"] = "不明牌/",
			["1"] = "明牌/"
		},
		["CallMode"] = {
			["0"] = "都不叫地主重新洗牌/",
			["1"] = "都不叫地主第一个叫的人当地主/"
		},
		["HaveForceCall"] = {
			["0"] = "不必叫地主/",
			["1"] = "四个2两王必叫地主/"
		},
		["AllowLandlordBouble"] = {
			["0"] = "不允许地主加倍/",
			["1"] = "允许地主加倍/"
		},
		["Allow3Cnt"] = {
			["0"] = "不允许出3张/",
			["1"] = "允许出3张/"
		},
		["Allow3With2"] = {
			["0"] = "不允许3带2/",
			["1"] = "允许3带2/"
		},
		["Allow4With4"] = {
			["0"] = "不允许4带2对/",
			["1"] = "允许4带2对/"
		},
		["BaseMultiple"] = {
			["1"] = "基础%d倍/"
		},
		["MaxMultiple"] = {
			["0"] = "不封顶/",
			["1"] = "封顶%d倍/"
		},
		["WinnerFirstCall"] = {
			["0"] = "",
			["1"] = "赢家先叫/"
		},
		["HostFirstCall"] = {
			["0"] = "随机先叫/",
			["1"] = "房主先叫/"
		},
		["ShowRemainCardsNum"] = {
			["0"] = "不显示剩余张数/",
			["1"] = "显示剩余张数/"
		}
	},
	[30409] = {
		["BombCount"] = {
			["1"] = "四炸封顶/"
		},
		["HaveForceCall"] = {
			["0"] = "",
			["1"] = ""
		},
		["Allow3Cnt"] = {
			["0"] = "日照玩法/",
			["1"] = "普通玩法/"
		},
		["Allow3With2"] = {
			["0"] = "",
			["1"] = ""
		},
    },
	[30424] = {
		["BombCount"] = {
			["1"] = "四炸封顶/"
		},
		["HaveForceCall"] = {
			["0"] = "",
			["1"] = ""
		},
		["Allow3Cnt"] = {
			["0"] = "",
			["1"] = "普通玩法/"
		},
		["Allow3With2"] = {
			["0"] = "",
			["1"] = ""
		},
    },
    [30442] = {
		["callScore"] = { ["0"] = "", ["1"] = "" },
		["BombCount"] = { ["1"] = "" },
		["addDouble"] = { ["0"] = "", ["1"] = "" },
		["allowOpenDeal"] = { ["0"] = "", ["1"] = "" },
		["CallMode"] = { ["0"] = "", ["1"] = "" },
		["HaveForceCall"] = { ["0"] = "", ["1"] = "四个2或者双王必叫地主/" },
		["AllowLandlordBouble"] = { ["0"] = "", ["1"] = "" },
		["Allow3Cnt"] = { ["0"] = "", ["1"] = "" },
		["Allow3With2"] = { ["0"] = "", ["1"] = "" },
		["Allow4With4"] = { ["0"] = "", ["1"] = "" },
		["BaseMultiple"] = { ["1"] = "底分:%d倍/" },
		["MaxMultiple"] = { ["0"] = "", ["1"] = "封顶:%d倍/" },
		["WinnerFirstCall"] = { ["0"] = "", ["1"] = "赢家先叫/" },
		["HostFirstCall"] = { ["0"] = "", ["1"] = "" },
		["ShowRemainCardsNum"] = { ["0"] = "", ["1"] = "显示剩余张数/" }
	},
	[30156] = {
		["HaveForceCall"] = {
			["0"] = "",
			["1"] = "四个2或双王必叫地主/"
		},
		["MaxMultiple"] = {
			["0"] = "不封顶/",
			["1"] = "%d倍封顶/"
		},
		["ShowRemainCardsNum"] = {
			["0"] = "",
			["1"] = "显示剩余张数/"
		}
	},
}

return tabX