local ShareWinConfig = {}

ShareWinConfig.ACTLIST = "big_card_share"

ShareWinConfig.ShowType = {
    Value = 1,  -- 展示数值
    Face = 2,   -- 展示牌面
}

ShareWinConfig.ValueType = {
    Value1 = 1,     -- 数值界面样式1
    Value2 = 2,     -- 数值界面样式2
    Value3 = 3,     -- 数值界面样式3
}

ShareWinConfig.FaceType = {
    Face1 = 1,     -- 牌面界面样式1
    Face2 = 2,     -- 牌面界面样式2
    Face3 = 3,     -- 牌面界面样式3
}

ShareWinConfig.ShareType = {
    Url = 1,    -- 分享URL
    Img = 2,    -- 分享图片
}

local DEBUG = require("app.Config.GlobalConfig").IsDebug
ShareWinConfig.ShareUrl = DEBUG and "http://appstore.racyqp.com:8009/common/bigcard?source=card" or "https://act.bfjiaxinmj.com/common/bigcard?source=card"
ShareWinConfig.Content = {
    {title = "牌桌我为王，对手全投降", text = "这局赢麻到没对手！分数高到离谱，看看谁能打破我的连胜纪录？"},
    {title = "完了！赢太多，对手都想退局了", text = "不是我想赢，是手气不允许～ 快来一起玩，让我也体验下输的感觉？"},
    {title = "牌神附体！这波操作直接杀疯了", text = "不是我吹，牌桌直接碾压，对手都被打懵～ 敢来 battle？看看谁才是真王者！"},
}

ShareWinConfig.IconUrl = "https://ioposs.gameteamobile.com/common/static/img/dp_1.png"

ShareWinConfig.SmallResult = {
    [900037] = {    -- 温茶
        [42038] = 200,      -- 千变双扣
        [30286] = 10,       -- 龙港麻将
        [30117] = 0,        -- 公共温州麻将金币
        [30579] = 1000,     -- 暗牌双扣金币
    },
    [900023] = {    -- 台州
        [30109] = 0,    -- 台州麻将
        [30400] = 0,    -- 台州麻将金币
        [30110] = 0,    -- 温岭麻将
        [30205] = 0,    -- 温岭麻将金币
        [42038] = 200,  -- 千变双扣
    },
    [900021] = {    -- 杭麻圈
        [30145] = 5,       -- 传统杭麻
        [30134] = 0,        -- 杭州麻将金币场
        [42038] = 200,      -- 千变双扣
        [30159] = 500,      -- 经典双扣
        [30144] = 2,        -- 跑得快
    },
    [900038] = {    -- 丽水
        [30287] = 0,        -- 广东麻将
        [30310] = 0,        -- 广东麻将金币
        [42038] = 300,      -- 千变双扣
        [30579] = 1000,       -- 暗牌双扣金币场
        [30386] = 0,        -- 二人关牌金币
        [30308] = 1,        -- 跑得快
    },
    [900017] = {    -- 熟客
        [30066] = 0,        -- 熟客温州麻将包厢
        [42038] = 400,      -- 千变双扣
        [30117] = 0,        -- 公共温州麻将金币
        [30579] = 1000,       -- 暗牌双扣金币场
    },
    [900008] = {    -- 湖州
        [30579] = 1000,     -- 暗牌双扣金币场
        [30421] = 300,      -- 丽水斗地主金币
        [30117] = 0,        -- 公共温州麻将金币
        [30310] = 0,        -- 广东麻将金币
        [30205] = 0,        -- 温岭麻将金币场
    },
    [40165] = { --嘉兴
        [30386] = 0,        -- 二人关牌金币
        [30134] = 0,        -- 杭州麻将金币场
        [30578] = 0,        -- 干瞪眼金币场
        [30400] = 0,        -- 台州麻将金币场
        [30332] = 0,        -- 灵溪台炮金币场
    },
    [900003] = {    -- 衢州
        [42038] = 500,      -- 千变双扣
    },
    [900036] = {    -- 瑞安
        [42038] = 500,      -- 千变双扣
    },
    [900046] = {    -- 绍兴3D
        [30412] = 0,      -- 上虞花麻将
    },
    [900020] = {    -- 金华
        [42038] = 500,      -- 千变双扣
    },
    [900043] = {    -- 舟山
        [30356] = 1,      -- 定海麻将
    },
    [900025] = {    -- 宝宝杭麻
        [30153] = 8,      -- 宝宝杭州麻将
    },
    [900006] = {    -- 宁波
        [30030] = 10,      -- 慈溪麻将
    },
    [900031] = {    -- 乐清
        [42038] = 500,      -- 千变双扣
    },
    [900039] = {    -- 青田
        [30288] = 0,      -- 青田麻将
    },
    [900007] = {    -- 嵊州
        [42038] = 200,      -- 千变双扣
    },
    [900029] = {    -- 余姚
        [30176] = 0,      -- 冲击麻将
    },
}

ShareWinConfig.BigWinLost = {
    [900037] = {    -- 温茶
        [30286] = 20,   -- 龙港麻将
    },
    [900023] = {    -- 台州
        [30109] = 10,    -- 台州麻将
        [30110] = 10,    -- 温岭麻将
    },
    [900021] = {    -- 杭麻圈
        [30145] = 10,       -- 传统杭麻
        [30144] = 10,       -- 跑得快
    },
    [900038] = {    -- 丽水
        [30287] = 10,        -- 广东麻将
        [30308] = 20,        -- 跑得快
    },
    [900017] = {    -- 熟客
        [30066] = 10,        -- 熟客温州麻将包厢
    },
    [900046] = {    -- 绍兴3D
        [30412] = 50,      -- 上虞花麻将
    },
    [900043] = {    -- 舟山
        [30356] = 10,      -- 定海麻将
    },
    [900025] = {    -- 宝宝杭麻
        [30153] = 20,      -- 宝宝杭州麻将
    },
    [900006] = {    -- 宁波
        [30030] = 10,      -- 慈溪麻将
    },
    [900039] = {    -- 青田
        [30288] = 10,      -- 青田麻将
    },
    [900029] = {    -- 余姚
        [30176] = 10,      -- 冲击麻将
    },
}

return ShareWinConfig