local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.WINLOST_FAN_TYPE = {

    [11] = "字一色",
    [23] = "对对胡",
    [29] = "门清",
    [31] = "混一色",
    [32] = "清一色",

    [33] = "大吊",
    [48] = "无财",

    [1001] = "爆头",
    [1002] = "财飘",
    [1003] = "一飘财",
    [1004] = "二飘财",
    [1005] = "三飘财",

    [1006] = "四飘财",
    [1007] = "杠开",
    [1008] = "四财神齐",
    [1009] = "四红中",
    [1010] = "四发财",

    [1011] = "四白板",
    [1012] = "无花无财",
    [1013] = "四花齐",
    [1014] = "豹子",
    [1015] = "天胡",
    [1016] = "无财",
    [1017] = "大吊",
    [1018] = "杠飘",
}

WinLostFanConfig.WINLOST_HUA_TYPE = {

    [3001] = "底花",
    [3002] = "花牌",
    [3003] = "普通明杠",
    [3004] = "普通暗杠",
    [3005] = "风牌刻",
    [3006] = "风牌明杠",
    [3007] = "风牌暗杠",
    [3008] = "财神",
}

return WinLostFanConfig