
local A = 1   --A新模式

local B = 0   --B老模式

local Config = {}

Config.A = A

Config.B = B

Config.ABTest = {
    --丽水
    [900038] = A,
    -- 温州（茶）
    [900037] = A,
    -- 熟客
    [900017] = A,
    -- 杭麻圈
    [900021] = B,
    -- 台州
    [900023] = B,
    -- 舟山
    [900043] = A,
    --湖州
    [900008] = A,
    -- 衢州
    [900003] = B,
    -- 瑞安
    [900036] = A,
    --金华
    [900020] = A,
    -- 宝宝杭麻
    [900025] = A,
    -- 乐清
    [900031] = B,
    -- 绍兴
    [900007] = B,
    -- 青田
    [900039] = B,
    -- 宁波
    [900006] = B,
    --嘉兴
    [40165] = A,
    -- 余姚
    [900029] = B,
    -- 绍兴3D
    [900046] = A,
}

return Config