local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	[23] = "对对胡",      --对对胡
    [31] = "混一色",      --混一色
    [41] = "天胡",        --天胡
    [42] = "地胡",        --地胡
    [1002] = "四花 ",      --双花
    [1003] = "无财神",    --无财神
    [1004] = "自家风",    --自家风
    [1005] = "红中",     --中发
    [1006] = "发财",     --中发
    [1007] = "双财神",    --双财神
    [1008] = "单财神",    --单财神
    [1009] = "三财神",    --三财神
    [1010] = "四财神",    --四财神
    [1011] = "自家花",    --自家花
    [1012] = "四风齐",    --四风齐
    [1013] = "天胡",
    [1014] = "地胡",
    [1015] = "大头对对碰", --大头对对碰
    [1016] = "清一色",    --清一色
    [1017] = "财神会",    --财神混
}

return WinLostFanConfig