local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.NewHangZhouMahjong.HangZhouMahjongBase.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	[90]   = "抢杠胡",
    [22]   = "杠花",
    [115]  = "单吊胡",
    [31]   = "混一色",
    [1031] = "字一色",
    [2905] = "杠开",
    [1020] = "圈风刻",
    [1019] = "坐风刻",
    [1018] = "中发白刻",
    [23]   = "对对胡",
    [2934] = "清一色",
    [39]   = "杠开",
    [1021] = "边张",
    [1022] = "坎张",
    [1023] = "财神爆头",
    [1024] = "自摸",
    [1025] = "坐风刻",
    [1026] = "天胡",
    [1027] = "平胡",
    [1028] = "平胡",
    [1030] = "平胡",
    [2000] = "花杠开",
    [1029] = "坐风刻",
    [40]   = "杠开",
    [10026]= "杠花",
    [1033] = "单吊胡"
} 

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [90] = 0,
    [115] = 1,
    [31] = 1, --"混一色",
    [1031] = 3,
    [2905] = 2,
    [1020] = 1,
    [1018] = 1,
    [1019] = 1,
    [23] = 1, --"对对胡",
    [2934] = 3, --"清一色",
    [39] = 1, --"杠开胡",
    [1021] = 1, --"红中刻",
    [1022] = 1, --"发财刻",
    [1023] = 1, --"白板刻",
    [1024] = 1, --"风台头",
    [1025] = 1, --"全部风牌",
    [1026] = 1, --"杠花"
    [1027] = 1, --"倍数"
    [1028] = 1, --"倍数"
    [1030] = 1, --"倍数"
    [2000] = 0, --"倍数"
    [10026] = 0,
    [40]   = 0,
    [22]   = 0,
    [1029] = 0,
    [1033] = 0,
}

return WinLostFanConfig