local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.JiaXing.BaseMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
    [39]                            = "杠开",
    [41]                            = "天胡",
    [43]                            = "地胡",
    [58]                            = "飘花",
    [55]                            = "双飘花",
    [56]                            = "三飘花",
    [59]                            = "爆头",
    [60]                            = "杠爆",
    [62]                            = "杠飘",
    [1010]                          = "杠开",
    [1011]                          = "二连杠开",
    [1012]                          = "三连杠开",
    [1013]                          = "四连杠开",
    [1020]                          = "无花自摸",
    [1021]                          = "抢杠胡",
    [1022]                          = "单吊点炮",
    [1023]                          = "无花大吊",
    [1024]                          = "有花大吊",
    [1025]                          = "黄番",
    [1026]                          = "双色子",
    [1027]                          = "三花",
    [1028]                          = "大于10",
    [1029]                          = "四花",
    [1030]                          = "地胡",
    [1031]                          = "自摸",
    [1032]                          = "天胡",
    [1033]                          = "爆头",
}

WinLostFanConfig.chiPengType =
{
    CHIPENG_2 = 1,
    CHENGBAO_3 = 2,
    UNLIMITED = 3,
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [39]                            = 2, --"杠开",
    [41]                            = 64,--"天胡",
    [43]                            = 64,--"地胡",
    [58]                            = 2,--"飘花",
    [55]                            = 4,--"双飘花",
    [56]                            = 8,--"三飘花",
    [59]                            = 2,--"爆头",
    [60]                            = 4,--"杠爆",
    [62]                            = 8,--"杠飘",
    [1010]                          = 2, --"一杠开",
    [1011]                          = 4, --"二杠开",
    [1012]                          = 8, --"三杠开",
    [1013]                          = 16, --"四杠开",
    [1020]                          = 2,--"无花自摸",
    [1021]                          = 4,--"抢杠胡",
    [1022]                          = 10,--"单吊点炮",
    [1023]                          = 8,--"无花大吊",
    [1024]                          = 4,--"有花大吊",
    [1025]                          = 2,--"黄番",
    [1026]                          = 2,--"双色子",
    [1027]                          = 2,--"三花",
    [1028]                          = 2,--"大于10",
    [1029]                          = 4,--"四花",
    [1030]                          = 64,--"地胡",
    [1031]                          = 1,--"自摸",
    [1032]                          = 64,--"天胡",
    [1033]                          = 2,--"爆头",
}

WinLostFanConfig.KW_FAN_NAME = {
    [1010] = {
        [56] = {
            name = "一杠三飘 ",
            flag = 1
        },
        [55] = {
            name = "一杠双飘 ",
            flag = 1
        },
        [58] = {
            name = "杠飘 ",
            flag = 1
        },
        [59] = {
            name = "杠爆 ",
            flag = 2
        },
        [1031] = {
            name = "有花杠开 ",
            flag = 3
        },
        [1020] = {
            name = "无花杠开 ",
            flag = 3
        }
    },
    [1011] = {
        [56] = {
            name = "二杠三飘 ",
            flag = 1
        },
        [55] = {
            name = "二杠双飘 ",
            flag = 1
        },
        [58] = {
            name = "二杠一飘 ",
            flag = 1
        },
        [59] = {
            name = "二连杠爆 ",
            flag = 2
        },
        [1031] = {
            name = "有花二连杠开 ",
            flag = 3
        },
        [1020] = {
            name = "无花二连杠开 ",
            flag = 3
        }
    },
    [1012] = {
        [56] = {
            name = "三杠三飘 ",
            flag = 1
        },
        [55] = {
            name = "三杠双飘 ",
            flag = 1
        },
        [58] = {
            name = "三杠一飘 ",
            flag = 1
        },
        [59] = {
            name = "三连杠爆 ",
            flag = 2
        },
        [1031] = {
            name = "有花三连杠开 ",
            flag = 3
        },
        [1020] = {
            name = "无花三连杠开 ",
            flag = 3
        }
    },
    [1013] = {
        [56] = {
            name = "四杠三飘 ",
            flag = 1
        },
        [55] = {
            name = "四杠双飘 ",
            flag = 1
        },
        [58] = {
            name = "四杠一飘 ",
            flag = 1
        },
        [59] = {
            name = "四连杠爆 ",
            flag = 2
        },
        [1031] = {
            name = "有花四连杠开 ",
            flag = 3
        },
        [1020] = {
            name = "无花四连杠开 ",
            flag = 3
        }
    },
}

return WinLostFanConfig