local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
    [1001] = "抛头",
    [1003] = "飞龙",
    [1004] = "二飞龙",
    [1005] = "三飞龙",
    [1007] = "杠开",
    [1008] = "四龙齐",
    [1009] = "四红中",
    [1010] = "四发财",
    [1011] = "四白板",
    [1012] = "无花无龙",
    [1013] = "四花齐",
    [1014] = "豹子",
    [1015] = "天胡",
    [11]   = "字一色",
    [48]   = "无龙",
    [29]   = "门清",
    [31]   = "混一色",
    [32]   = "清一色",
    [33]   = "大吊",
    [23]   = "对对胡",
    [41]   = "天胡"
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS = {
    [1001] = 1,--"抛头",
    [1003] = 1,--"飞龙",
    [1004] = 2,--"二飞龙",
    [1005] = 3,--"三飞龙",
    [1007] = 1,--"杠开",
    [1008] = 1,-- "四龙齐",
    [1009] = 1,-- "四红中",
    [1010] = 1,-- "四发财",
    [1011] = 1,-- "四白板",
    [1012] = 0,--"无花无龙"
    [1013] = 1,--"四花齐"
    [1014] = 1,--"豹子",
    [1015] = 0,--"天胡",
    [48]   = 1,--"无龙"
    [29]   = 1,--"门清"
    [31]   = 1,--"混一色"
    [32]   = 2,--"清一色"
    [33]   = 1,--"大吊"
    [41]   = 0,--"天胡"
    [23]   = 1,--"对对胡"
    [11]   = 0,--"字一色"
}

return WinLostFanConfigr