local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.JiaXing.BaseMahjong.Config.WinLostFanConfig")

-- 番数
WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
    [23]                = "对对胡",
    [31]                = "混一色",
    [32]                = "清一色",
    [48]                = "无百搭",
    [51]                = "三百搭",
    [90]                = "抢杠胡",
    [1101]              = "四花",
    [1102]              = "单吊",
    [1103]              = "杠上开花",
    [1105]              = "双色子",
    [1106]              = "风百搭",
    [1107]              = "19百搭",
    [1108]              = "天胡",
    [1109]              = "地胡",
    [1110]              = "抢杠胡",
    [1111]              = "混一色",
    [1112]              = "对对胡",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS = {
    [23]                = 1, --"对对胡",
    [31]                = 1, --"混一色",
    [32]                = 2, --"清一色",
    [48]                = 1, --"无百搭",
    [51]                = 1, --"三百搭",
    [90]                = 1, --"杠上开花",
    [1101]              = 1, --"四花",
    [1102]              = 1, --"单吊",
    [1103]              = 1, --"杠上开花",
    [1105]              = 1, --"双色子",
    [1106]              = 1, --"风百搭",
    [1107]              = 1, --"19百搭",
    [1108]              = 1, --"天胡",
    [1109]              = 1, --"地胡",
    [1110]              = 1, --"抢杠胡",
    [1111]              = 1, --"混一色",
    [1112]              = 1, --"对对胡"
}

return WinLostFanConfig�