
local A = 0   --A选中

local B = 1   --B不选中

local Config = {}

Config.A = A

Config.B = B

Config.ABTest = {
    --丽水
    [900038] = B,
    -- 温州（茶）
    [900037] = B,
    -- 熟客
    [900017] = B,
    -- 杭麻圈
    [900021] = B,
    -- 台州
    [900023] = B,
    -- 舟山
    [900043] = B,
    --湖州
    [900008] = B,
    -- 衢州
    [900003] = B,
    -- 瑞安
    [900036] = B,
    --金华
    [900020] = B,
    -- 宝宝杭麻
    [900025] = B,
    -- 乐清
    [900031] = B,
    -- 绍兴
    [900007] = B,
    -- 青田
    [900039] = B,
    -- 宁波
    [900006] = B,
    --嘉兴
    [40165] = B,
    -- 余姚
    [900029] = B,
    -- 绍兴3D
    [900046] = B,
}

return Config