local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
    [2800] = "平胡",
    [2801] = "爆头",
    [2802] = "财飘",
    [2803] = "双财飘",
    [2804] = "三财飘",
    [2805] = "杠开",
    [2806] = "二连杠",
    [2807] = "三连杠",
    [2808] = "四连杠",
    [2809] = "七对子",
    [2810] = "豪华七对",
    [2811] = "双豪华七对",
    [2812] = "三豪华七对",
    [2813] = "清七对",
    [2814] = "豪华清七对",
    [2815] = "双豪华清七对",
    [2816] = "三豪华清七对",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [2800] = 1,
    [2801] = 2,
    [2802] = 4,
    [2803] = 8,
    [2804] = 16,
    [2805] = 2,
    [2806] = 4,
    [2807] = 8,
    [2808] = 16,
    [2809] = 2,
    [2810] = 4,
    [2811] = 8,
    [2812] = 16,
    [2813] = 4,
    [2814] = 8,
    [2815] = 16,
    [2816] = 32,
}

return WinLostFanConfig�