local WinLostFanConfig = CF.gameClass("WinLostFanConfig","game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.WINLOST_FAN_TYPE = 
{        
    [2400] = {"平胡",},
    [2401] = {"敖包胡",},
    [2402] = {"十三幺",},
    [2403] = {"七星十三幺",},
    [2404] = {"对对胡",},
    [2405] = {"七小对",},
    [2406] = {"混一色",},
    [2407] = {"清一色",},
    [2408] = {"字一色",},
    [2409] = {"小三元",},
    [2410] = {"大三元",},
    [2411] = {"小四喜",},
    [2412] = {"大四喜",},

    [2413] = {"铁壳",},
    [2414] = {"一条龙",},
    [2415] = {"单吊",},
    [2416] = {"杠开",},
    [2417] = {"抢杠",},
    [2418] = {"海底捞月",},
    [2419] = {"海底放炮",},
    [2420] = {"地胡",},
    [2421] = {"天胡",},

    [2422] = {"双对花",},
    [2423] = {"三对花",},
    [2424] = {"野四花",},
    [2425] = {"真四花",},
    [2426] = {"八花全",},

    
    [3001] = {"花",},
    [3002] = {"刻子",},
    [3003] = {"杠",},
}


return WinLostFanConfig8