local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
    [2600] =  "七对子",
    [2601] =  "豪华七对",
    [2602] =  "双豪华七对",
    [2603] =  "三豪华七对",
    [2604] =  "清一色",
    [2605] =  "混一色",
    [2606] =  "正规十三幺",
    [2607] =  "不正规十三幺",
    [2608] =  "正规七风",
    [2609] =  "不正规七风",
    [2610] =  "财神头",
    [2611] =  "全字",
    [2612] =  "三财神",
    [2613] =  "财飘",
    [2614] =  "财杠",
    --[2615] =  "抢杠胡", --5番
    [2616] =  "杠上开花",
    [2617] =  "单吊",
    [2618] =  "天胡",
    [2619] =  "地胡",
    [2620] =  "平胡",
    [2621] =  "碰碰胡",
    [2622] =  "双飘",

    --打板里的特色番型
    [2623] =  "豪华十三幺",
    [2624] =  "超豪华十三幺",
    [2625] =  "豪华七风",
    [2626] =  "超豪华七风",
    [2627] =  "海底捞月",
    [2628] =  "多连杠",
    [2629] =  "抢杠胡", --打板中的抢杠胡 1番

    [2630] =  "抢杠胡", --5番
    [2631] =  "杠飘",
    [2632] =  "二杠飘"
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    [2600] =  2,--"七对子"
    [2601] =  4,--"豪华七对",
    [2602] =  8,--"双豪华七对",
    [2603] =  16,--"三豪华七对",
    [2604] =  4,--"清一色",
    [2605] =  2,--"混一色",
    [2606] =  2,--"正规十三幺",
    [2607] =  1,--"不正规十三幺",
    [2608] =  4,--"正规七风",
    [2609] =  2,--"不正规七风",
    [2610] =  2,--"财神头",
    [2611] =  4,--"全字",
    [2612] =  2,--"三财神",
    [2613] =  4,--"财飘",
    [2614] =  4,--"财杠",
    --[2615] =  "抢杠胡", --5番
    [2616] =  2,--"杠上开花",
    [2617] =  2,--"单吊",
    [2618] =  2,--"天胡",
    [2619] =  2,--"地胡",
    [2620] =  1,--"平胡",
    [2621] =  2,--"碰碰胡",
    [2622] =  8,--"双飘",

    --打板里的特色番型
    [2623] =  4,--"豪华十三幺",
    [2624] =  8,--"超豪华十三幺",
    [2625] =  8,--"豪华七风",
    [2626] =  16,--"超豪华七风",
    [2627] =  2,--"海底捞月",
    [2628] =  "",--"多连杠",
    [2629] =  1,--"抢杠胡", --打板中的抢杠胡 1番

    [2630] =  5,--"抢杠胡", --5番
    [2631] =  8,--"杠飘",
    [2632] =  16--"二杠飘"
}

return WinLostFanConfig