local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")
WinLostFanConfig.KW_WINLOST_FAN_TYPE = 
{
    --余姚麻将
    [14] = "对对碰",
    [16] = "十三不搭",
    [23] = "大对对",
    [41] = "天胡",
    [42] = "地胡",

    [1001] = "抛龙",
    [1002] = "杠暴",
    [1003] = "清七对",
    [1004] = "七风齐",
    [1005] = "一杠一达",
    [1006] = "二杠二达",
    [1007] = "三杠三达",
    [1008] = "海底捞月",
    [1009] = "单吊",
    [1010] = "全风向",
    [1011] = "全风向(有牌型)",
    [1012] = "四财神",
    [1014] = "无龙",
    [1015] = "混一色",
    [1016] = "清一色",
    [1017] = "七嵌",
    [1018] = "十一风",
    [1019] = "无龙清一色",

    [1021] = "天胡",
    [1022] = "地胡",
    [1023] = "对对碰",
    [1024] = "十三不搭",
    [1025] = "大对对",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    --余姚麻将
    [14] = 1,
    [16] = 1,
    [23] = 1,
    [41] = 10,
    [42] = 10,

    [1001] = 10,
    [1002] = 10,
    [1003] = 10,
    [1004] = 1,
    [1005] = 1,
    [1006] = 1,
    [1007] = 1,
    [1008] = 10,
    [1009] = 10,
    [1010] = 50,
    [1011] = 100,
    
    [1012] = 100,
    [1014] = 2,
    
    [1015] = 1,
    
    [1016] = 10,
    [1017] = 1,
    [1018] = 1,
    [1019] = 100,

    [1021] = 10,
    [1022] = 10,
    [1023] = 1,
    [1024] = 1,
    [1025] = 1,
}
    
return WinLostFanConfig
