local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE =
{
--金华麻将
    [2900] = "平胡",
    [2901] = "碰碰胡无财神",
    [2902] = "全求人",
    [2903] = "七对",
    [2904] = "清七对",
    [2905] = "七对爆头",
    [2906] = "十三不靠",
    [2907] = "七风无财神",
    [2908] = "杠上开花",
    [2909] = "清一色有财神",
    [2910] = "乱风",
    [2911] = "清风",
    [2912] = "财神头",
    [2913] = "三财一刻",
    [2914] = "爆头",
    [2915] = "杠爆",
    [2916] = "天胡",
    [2917] = "地胡",
    [2918] = "清一色无财神",
    [2919] = "海底捞月",
    [2920] = "末四张点炮",
    [2921] = "抢杠胡",
    [2922] = "碰碰胡有财神",
    [2923] = "七风有财神",
    [2924] = "豪华七对有财神",
    [2925] = "豪华七对无财神",
    [2926] = "财神归位",
}

return WinLostFanConfig