local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.TAITYPE={
    [1102]  ="清一色",
    [1107]  ="混一色",
    [1103]  ="全老头",
    [23]    ="对对胡",
    
    [100]   ="红中刻",
    [101]   ="发财刻",
    [102]   ="白板刻",
    [103]   ="东风刻",
    [104]   ="南风刻",
    [105]   ="西风刻",
    [106]   ="北风刻",
    [107]   ="东风圈刻",
    [108]   ="南风圈刻",
    [109]   ="西风圈刻",
    [110]   ="北风圈刻",
    [111]   ="无百搭",
}

WinLostFanConfig.TAIPOINT={
    [1102]  =4,
    [1107]  =2,
    [1103]  =8,
    [23]    =2,

    [100]   =1,
    [101]   =1,
    [102]   =1,
    [103]   =1,
    [104]   =1,
    [105]   =1,
    [106]   =1,
    [107]   =1,
    [108]   =1,
    [109]   =1,
    [110]   =1,
    [111]   =1,
}
-- 抬头胡番数
WinLostFanConfig.KW_WINLOST_TAI_FAN_TYPE={
    [39]                    = "杠上开花",
    [51]                    = "三百搭",
    [1101]                  = "单吊",
    [1104]                  = "天胡",
    [1105]                  = "海底捞月",
    [1106]                  = "地胡",
}
WinLostFanConfig.KW_WINLOST_TAI_FAN_NUMS={
    [39]                    = 1,
    [51]                    = 1,
    [1101]                  = 1,
    [1104]                  = 2,
    [1105]                  = 1,
    [1106]                  = 2,
}

-- 嘉兴麻将硬自摸，触电胡番数
WinLostFanConfig.KW_WINLOST_FAN_TYPE={
    [14]                    = "七小对",
    [23]                    = "对对胡",
    [1107]                  = "混一色",
    [39]                    = "杠上开花",
    [48]                    = "无百搭",
    [51]                    = "三百搭",
    [1101]                  = "单吊",
    [1102]                  = "清一色",
    [1103]                  = "全老头",
    [1104]                  = "天胡",
    [1105]                  = "海底捞月",
    [1106]                  = "地胡",
    [1108]                  = "天胡",
    [1109]                  = "单吊",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS={
    [14]                    = 1,
    [23]                    = 1,
    [1107]                  = 1,
    [39]                    = 1,
    [48]                    = 1,
    [51]                    = 2,
    [1101]                  = 1,
    [1102]                  = 2,
    [1103]                  = 3,
    [1104]                  = 5,
    [1105]                  = 1,
    [1106]                  = 4,
    [1108]                  = 6,
    [1109]                  = 2,
}

WinLostFanConfig.KW_WINLOST_FAN_TYPE_2P={
    [14]                    = "七小对",
    [23]                    = "对对胡",
    [31]                    = "混一色",
    [39]                    = "杠上开花",
    [43]                    = "地胡",
    [48]                    = "无百搭",
    [51]                    = "三百搭",
    [1101]                  = "单吊",
    [1102]                  = "清一色",
    [1103]                  = "全老头",
    [1104]                  = "天胡",
    [1105]                  = "海底捞月",
    [1106]                  = "地胡",
    [1108]                  = "天胡",
    [1109]                  = "单吊",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS_2P={
    [14]                    = 1,            -- 七小对
    [23]                    = 1,            -- 对对胡
    [31]                    = 1,            -- 混一色
    [39]                    = 1,            -- 杠上开花
    [43]                    = 4,            -- 地胡
    [48]                    = 1,            -- 无百搭
    [51]                    = 2,            -- 三百搭
    [1101]                  = 1,            -- 单吊
    [1102]                  = 2,            -- 清一色
    [1103]                  = 3,            -- 全老头
    [1104]                  = 5,            -- 天胡
    [1105]                  = 1,            -- 海底捞月
    [1106]                  = 4,
    [1108]                  = 6,
    [1109]                  = 2,
}

return WinLostFanConfig