local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	--安吉
    [2800] = "有财神自摸",
    [2801] = "无财神自摸",
    [2802] = "十三幺",
    [2803] = "抓头",
    [2804] = "有财神七对",
    [2805] = "无财神七对",

    [2806] = "大吊",
    [2807] = "无花无财神",
    [2808] = "清一色",
    [2809] = "飘财",
    [2810] = "有财神杠开",
    [2811] = "无财神杠开",
    [2812] = "杠爆",
    [2813] = "飘杠",
    [2814] = "四财神",--"四财神",
    [2815] = "天胡",
    [2816] = "地胡",
    [2817] = "四财神飘",
}

WinLostFanConfig.KW_WINLOST_FAN_NUMS =
{
    --安吉
    [2800] = 1,--有财神自摸
    [2801] = 2,--无财神自摸
    [2802] = 2,--十三幺
    [2803] = 2,--抓头
    [2804] = 1,--有财神七对
    [2805] = 2,--无财神七对

    [2806] = 10,--大吊
    [2807] = 20,--无花无财神
    [2808] = 10,--清一色
    [2809] = 10,--飘财
    [2810] = 3 ,--有财神杠开
    [2811] = 5 ,--无财神杠开
    [2812] = 5 ,--杠爆
    [2813] = 15,--飘杠
    [2814] = 10,--四财神
    [2815] = 10,--天胡
    [2816] = 10,--地胡
    [2817] = 10,--四财神飘
}

WinLostFanConfig.FANID_TO_ANI =
{
    [2800] = "zimo",             --"有财神自摸",
    [2801] = "zimo",             --"无财神自摸",
    [2802] = "shisanyao",        --"十三幺",
    [2803] = "zhuatou",          --"抓头",
    [2804] = "qidui",            --"有财神七对",
    [2805] = "qidui",            --"无财神七对",
    [2806] = "dadiao",           --"大吊",
    [2807] = "",                 --"无花无财神"
    [2808] = "qingyise",         --"清一色",
    [2809] = "",                 --"飘财",
    [2810] = "gangkai",          --"有财神杠开",
    [2811] = "gangkai",          --"无财神杠开",
    [2812] = "gangbao",          --"杠爆",
    [2813] = "piaogang",         --"飘杠",
    [2814] = "sicaishen",        --"四财神",
    [2815] = "tianhu",           --"天胡",
    [2816] = "dihu",             --"地胡",
    [2817] = "sicaishenpiao",    --"四财神飘",
}

return WinLostFanConfig�