local WinLostFanConfig = CF.gameClass("WinLostFanConfig", "game.Mahjong.BasicMahjong.Config.WinLostFanConfig")

WinLostFanConfig.KW_WINLOST_FAN_TYPE = {
	[23] = "对对碰",       --碰碰胡
    [33] = "单吊",         --单吊
    [50] = "双财神",       --双财神
    [51] = "三财神",       --三财神
    [1002] = "红中",       --红中
    [1003] = "发财",       --发财
    [1004] = "自家风",     --自家风
    [1005] = "1白板",       --白板
    [1006] = "2白板",
    [1007] = "3白板",
    [1008] = "4白板",
    [1009] = "1红中",      --红中坐白板
    [1010] = "2红中",
    [1011] = "3红中",
    [1012] = "4红中",
    [1013] = "平胡",        --平胡
    [1014] = "海底捞月",    --海底捞月
    [1015] = "四风齐",      --四风齐
    [1016] = "清一色",      --清一色
    [1017] = "天胡",        --天胡
    [1018] = "地胡",        --地胡
    [1019] = "混一色",       --混一色
    [1020] = "杠上开花",     --杠上开花
    [1021] = "抢杠胡",       --抢杠胡
    [1022] = "三财神",       --抢杠胡
    [1023] = "推倒胡",       --抢杠胡
}

return WinLostFanConfig